OdDAI.AggrOrdered.getValueBoundByIndex(System.Int32)
\details
Get value bound.
\param index [in] An index of value.
\returns Value bound.

OdDAI.AggrOrdered.createAggrInstanceByIndex(System.Int32,OdDAI.Aggr**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a child aggregate by index.
\param index [in] an index where aggregate create to.
\param newAggr [in/out] output parameter. If succeeded it should filled by a pointer of new child aggregate.

OdDAI.AggrOrdered.insertByIndex(System.Int32,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Insert aggregate item to specified position.
\param index [in] an index item to insert.
\param element [in] a value for item set.

OdDAI.AggrOrdered.putByIndex(System.Int32,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Puts aggregate item by index.
\param index [in] an index item to put.
\param element [in] a value for item set.

OdDAI.AggrOrdered.getByIndex(System.Int32)
\details
Provides aggregate item by index.
\param index [in] an index item.
\returns Returns an OdRxValue of aggregate element.

OdDAI.AggrOrdered
\details
Class for containers defined within a schema.